# Task1
import random

minute = random.randint(0, 59)

if 0 <= minute <= 14:
    print(f"Число {minute} знаходиться у першій четверті години")
elif 15 <= minute <= 29:
    print(f"Число {minute} знаходиться у другій четверті години")
elif 30 <= minute <= 44:
    print(f"Число {minute} знаходиться у третій четверті години")
else:
    print(f"Число {minute} знаходиться у четвертій четверті години")

# Task2
print('Запишіть номер місяця вашого народження: ')
birth_month = int(input())

if 1<= birth_month <= 2 or birth_month == 12:
    print('За вікном падав сніг.')
elif 3 <= birth_month <= 5:
    print('Все довкола розцвітало.')
elif 6 <= birth_month <= 8:
    print('Діти насолоджувались літніми канікулами.')
elif 9 <= birth_month <= 11:
        print('Все довкола загоралось яскравими фарбами.')
else:
    print('На жаль, у році не може бути більше 12 місяців. Будь ласка, спробуйте ще раз')

#Task3
print('Введіть число х: ')
x = float(input())
print('Введіть число y: ')
y = float(input())

if x > 0 and y > 0:
    print(f"Точка з координатами {x} ; {y} належить першій координатній чверті")
elif x > 0 and y < 0:
    print(f"Точка з координатами {x} ; {y} належить другій координатній чверті")
elif x < 0 and y < 0:
    print(f"Точка з координатами {x} ; {y} належить третій координатній чверті")
elif x < 0 and y > 0:
    print(f"Точка з координатами {x} ; {y} належить четвертій координатній чверті")
elif x > 0 and y == 0:
    print(f"Точка з координатами {x} ; {y} лежить на осі у")
elif x < 0 and y == 0:
    print(f"Точка з координатами {x} ; {y} лежить на осі у")
elif x == 0 and y < 0:
    print(f"Точка з координатами {x} ; {y} лежить на осі x")
elif x == 0 and y > 0:
    print(f"Точка з координатами {x} ; {y} лежить на осі x")
elif x == 0 and y == 0:
    print(f"Точка з координатами {x} ; {y} лежить на перетині осей х та у")